<?php include('comtop.php') ?>
    <div class="bg-top-regiser"></div>
<div class="container-fluid main-content" id="grad1">   
    <div class="row">
        <div class="col-xl-12 text-center">
            <img src="assets/images/Logo_main_1.png" class="logo_main_form" alt="">
        </div>
    </div>
    <div class="row justify-content-center mt-0" >
        <div class="col-11 col-sm-9 col-md-7 col-lg-6 text-center p-0 mt-3 mb-2">
            <div class="card card-bg-form">
                <h2><strong class="text-form-register">ลงทะเบียนเพื่อใช้งานระบบของกรมโยธาธิการและผังเมือง</strong></h2>
                <div class="row">
                    <div class="col-md-12 mx-0">
                        <form id="msform">
                            <!-- progressbar -->
                            <ul id="progressbar" class="d-flex justify-content-center">
                                <!-- <li class="active" id="account"><strong>ประกาศ</strong></li>
                                <li id="personal"><strong>บุคคล</strong></li> -->
                                <!-- <li id="payment"><strong>Payment</strong></li>
                                <li id="confirm"><strong>Finish</strong></li> -->
                            </ul>
                            <!-- fieldsets -->
                            <fieldset>
                                <div class="form-card">
                                    <div class="row">
                                        <div class="col-xl-12 text-center">
                                            <h4>ข้อตกลงในการใช้บริการอิเล็กทรอนิกส์ของกรมโยธาธิการและผังเมือง</h4>
                                        </div>
                                    </div>
                                        <div class=row> 
                                            <div class=col-xl-12 > 
                                                <p> กรมโยธาธิการและผังเมือง ตระหนักและให้ความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลของผู้มาติดต่อและ ใช้บริการของ กรมโยธาธิการและผังเมือง จึงเป็นการสมควรกำหนดนโยบายการคุ้มครองข้อมูลส่วนบุคคล เพื่อแจ้งให้ทราบถึงการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                                                <p>ข้อ 1 หลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคลกรมโยธาธิการและผังเมือง จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล โดยอยู่บนพื้นฐานหลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคล ดังนี้</p>
                                                <ul class="text-multi"> 
                                                    <li>(1.1) เก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลเป็นไปโดยชอบด้วยกฎหมาย เป็นธรรม และมีความโปร่งใส ต่อเจ้าของข้อมูลส่วนบุคคล</li>
                                                    <li>(1.2) เก็บรวบรวมข้อมูลส่วนบุคคลด้วยวิธีการที่ชอบด้วยกฎหมาย และจัดเก็บข้อมูลเท่าที่จำเป็นตามวัตถุประสงค์ในการดำเนินงาน และตามที่กฎหมายกำหนดเท่านั้น โดยจะต้องได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล เว้นแต่เป็นกรณีที่กฎหมายกำหนดให้สามารถประมวลผลข้อมูลส่วนบุคคลได้โดยไม่ต้องได้รับความยินยอม</li>
                                                    <li>(1.3) เก็บรวบรวมข้อมูลส่วนบุคคลเท่าที่จำเป็นตามวัตถุประสงค์อันชอบด้วยกฎหมาย </li>
                                                    <li>(1.4) ข้อมูลส่วนบุคคลควรมีความถูกต้องและเป็นปัจจุบัน โดยจะต้องมีการดำเนินการเพื่อให้แน่ใจว่าข้อมูลส่วนบุคคลที่ไม่ถูกต้องจะได้รับการปรับปรุงแก้ไข </li>
                                                    <li>(1.5) ประมวลผลข้อมูลส่วนบุคคลตามระยะเวลาเท่าที่จำเป็นต่อการประมวลผลข้อมูลส่วนบุคคล เว้นแต่กรณีมีกฎหมายกำหนดไว้ต้องจัดเก็บข้อมูลส่วนบุคคลไว้นานกว่าระยะเวลาเท่าที่จำเป็นดังกล่าว</li>
                                                    <li>(1.6) การประมวลผลข้อมูลส่วนบุคคลต้องมีมาตรการในการรักษาความมั่นคงปลอดภัยที่เหมาะสม รวมถึงมีการป้องกันการประมวลผลข้อมูลส่วนบุคคลโดยไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมายและป้องกันการสูญหายโดยอุบัติเหตุ การถูกทำลาย หรือถูกทำให้เสียหาย</li>
                                                </ul>
                                                <p>ข้อ 2 ขอบเขตการบังคับใช้
                                                    นโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ มีขอบเขตการบังคับใช้ครอบคลุมการประมวลผลข้อมูลส่วนบุคคลที่อยู่ในความครอบครองหรือควบคุมดูแลของ กรมโยธาธิการและผังเมือง
                                                    สำหรับข้อมูลส่วนบุคคลที่ได้เก็บรวบรวมไว้ก่อนวันที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                                                    ใช้บังคับ กรมโยธาธิการและผังเมือง จะเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลนั้นต่อไปตามวัตถุประสงค์เดิม</p>
                                                <p>ข้อ 3 หลักการสำคัญในการประมวลผลข้อมูลส่วนบุคคล
                                                    กรมโยธาธิการและผังเมือง จะประมวลผลข้อมูลส่วนบุคคลโดยปฏิบัติตามหลักการสำคัญในการประมวลผลข้อมูลส่วนบุคคล ดังนี้</p>
                                                    <ul class="text-multi "> 
                                                    <li>(3.1) ต้องแจ้งรายละเอียดการประมวลผลข้อมูลส่วนบุคคลให้เจ้าของข้อมูลส่วนบุคคลทราบก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล</li>
                                                    <li>(3.2) ต้องได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนการประมวลผลข้อมูลส่วนบุคคล เว้นแต่กรณีดังต่อไปนี้ สามารถประมวลผลข้อมูลส่วนบุคคลได้โดยไม่ต้องได้รับความยินยอม</ี>
                                                        <ul class="t-multi3">(3.2.1) เพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องกับการจัดทำเอกสารประวัติศาสตร์หรือจดหมายเหตุเพื่อประโยชน์สาธารณะ หรือที่เกี่ยวข้องกับการศึกษาวิจัย หรือสถิติ</ul>
                                                        <ul class="t-multi3">(3.2.2) เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล</ul>
                                                        <ul class="t-multi3">(3.2.3) เพื่อปฏิบัติตามกฎหมาย</ul>
                                                        <ul class="t-multi3">(3.2.4) เป็นการจำเป็นเพื่อการปฏิบัติตามสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญา หรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลส่วนบุคคลก่อนเข้าทำสัญญา </ul>
                                                        <ul class="t-multi3">(3.2.5) เป็นการจำเป็นเพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะของผู้ควบคุมข้อมูลส่วนบุคคล หรือปฏิบัติหน้าที่ในการใช้อำนาจรัฐที่ได้มอบให้แก่ผู้ควบคุมข้อมูลส่วนบุคคล</ul>
                                                        <ul class="t-multi3">(3.2.6) เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของผู้ควบคุมข้อมูลส่วนบุคคล หรือบุคคล หรือนิติบุคคลอื่นที่ไม่ใช่ผู้ควบคุมข้อมูลส่วนบุคคล เว้นแต่ประโยชน์ดังกล่าวมีความสำคัญน้อยกว่าสิทธิขั้นพื้นฐานในข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล</ul>
                                                    <li>(3.3) ไม่เก็บรวบรวมข้อมูลส่วนบุคคลที่มีความอ่อนไหว รวมถึงการเก็บรวบรวมข้อมูลส่วนบุคคลของผู้เยาว์ คนไร้ความสามารถ หรือคนเสมือนไร้ความสามารถ เว้นแต่ได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลหรือผู้มีอำนาจกระทำแทนเจ้าของข้อมูลส่วนบุคคลโดยชัดแจ้ง หรือได้รับยกเว้นตามที่กฎหมายกำหนด</li>
                                                    <li>(3.4) ไม่เปิดเผยข้อมูลส่วนบุคคลที่มีการจัดเก็บรวบรวมไว้ให้กับบุคคลอื่น เว้นแต่ได้รับความยินยอมจากเจ้าของข้อมูลโดยทำหนังสือให้ความยินยอมเปิดเผยข้อมูลส่วนบุคคลเป็นลายลักษณ์อักษร หรือกรณีตามมาตรา 80 แห่งพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 หรือตามมาตรา 24 แห่งพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2540</li>
                                                </ul> 
                                                <p>ข้อ 4 แนวทางในการกำกับดูแลและบริหารจัดการข้อมูลส่วนบุคคลเพื่อยึดมั่นเป็นหลักการและใช้เป็นแนวทางในการกำกับดูแลและบริหารจัดการข้อมูลส่วนบุคคลที่อยู่ในความครอบครองหรือควบคุมดูแลของ กรมโยธาธิการและผังเมือง</p>
                                                    <ul class="text-multi"> 
                                                        <li>(4.1) บุคลากรของ กรมโยธาธิการและผังเมือง รวมถึงผู้ปฏิบัติงานให้ กรมโยธาธิการและผังเมือง ต้องปฏิบัติตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล นโยบาย ระเบียบ ข้อบังคับ คู่มือ หรือแนวปฏิบัติใดๆ ของ กรมโยธาธิการและผังเมือง ที่เกี่ยวข้องกับการคุ้มครองข้อมูลส่วนบุคคลอย่างเคร่งครัด</li>
                                                        <li>(4.2) จัดให้มีการอบรมให้ความรู้ ส่งเสริมให้บุคลากรของ กรมโยธาธิการและผังเมือง ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล และส่งเสริมให้มีการบริหารความเสี่ยงด้านการคุ้มครองข้อมูลส่วนบุคคลในทุกระดับขององค์กร รวมถึงจัดให้มีมาตรการควบคุมภายในที่มีประสิทธิภาพ เพื่อป้องกันการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบ</li>
                                                        <li>(4.3) จัดให้มีเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล เพื่อปฏิบัติหน้าที่ในการให้คำแนะนำ คำปรึกษา ตรวจสอบการดำเนินงานที่เกี่ยวข้องกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของ กรมโยธาธิการและผังเมือง ให้เป็นไปตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล รวมถึงทำหน้าที่ประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล</li>
                                                        <li>(4.4) จัดให้มีการกำหนดวิธีการ ช่องทาง และผู้รับผิดชอบในการรับเรื่องร้องเรียน คำร้อง และดำเนินการใดๆ รองรับการใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล เพื่อตรวจสอบและทำให้เจ้าของข้อมูลมั่นใจได้ว่า กรมโยธาธิการและผังเมือง ได้ดำเนินการตอบสนองต่อคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลอย่างเหมาะสม โดยไม่ชักช้า และอยู่ภายในระยะเวลาที่กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลกำหนด ทั้งนี้ ในกรณีที่ กรมโยธาธิการและผังเมือง ปฏิเสธคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคล กรมโยธาธิการและผังเมือง ต้องจัดทำบันทึกรายการการปฏิเสธคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลดังกล่าวพร้อมระบุเหตุผลไว้ด้วย</li>
                                                        <li>(4.5) จัดให้มีกระบวนการจัดทำและเก็บรักษาบันทึกรายการประมวลผลข้อมูลส่วนบุคคล ตามหลักเกณฑ์และวิธีการที่กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลกำหนด เพื่อให้เจ้าของข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล สามารถตรวจสอบได้ โดยต้องดำเนินการให้บันทึกรายการประมวลผลข้อมูลส่วนบุคคลดังกล่าวมีความถูกต้อง ครบถ้วน เป็นปัจจุบัน และสมบูรณ์อยู่เสมอ</li>
                                                        <li>(4.6) จัดให้มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล เพื่อป้องกันการสูญหาย เข้าถึงใช้ เปลี่ยนแปลง หรือเปิดเผยข้อมูลส่วนบุคคลที่อยู่ในความครอบครองของกรมโยธาธิการและผังเมือง โดยมิชอบ รวมถึงจัดให้มีการทบทวนและตรวจสอบมาตรการดังกล่าว</li>
                                                        <li>(4.7) จัดให้มีกระบวนการตรวจสอบการดำเนินการลบหรือทำลายข้อมูลส่วนบุคคลเมื่อพ้นกำหนดระยะเวลาการเก็บรักษา หรือเก็บข้อมูลส่วนบุคคลที่ไม่เกี่ยวข้อง หรือเกินความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</li>
                                                        <li>(4.8) กรณีที่มีความจำเป็นต้องใช้ผู้ประมวลผลข้อมูลส่วนบุคคล ดำเนินการเกี่ยวกับการเก็บรวบรวมใช้ หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามกรมโยธาธิการและผังเมืองนั้น กรมโยธาธิการและผังเมืองต้องจัดให้มีสัญญาการเก็บรักษาข้อมูลไว้เป็นความลับ และ/หรือข้อตกลงระหว่างกัน เพื่อควบคุมการดำเนินงานตามหน้าที่ของ ผู้ประมวลผลข้อมูลส่วนบุคคลให้เป็นไปตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล และป้องกันมิให้ผู้ประมวลผลข้อมูลส่วนบุคคล ใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบหรือเกินขอบเขตที่กำหนด</li>
                                                        <li>(4.9) ทุกส่วนงานต้องให้ความร่วมมือกับเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลในการแจ้งเหตุการณ์ละเมิดข้อมูลส่วนบุคคลแก่สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล โดยไม่ชักช้าภายใน 72 ชั่วโมง นับแต่ทราบเหตุ ทั้งนี้ กรมโยธาธิการและผังเมืองจะแจ้งเหตุการณ์ละเมิดให้เจ้าของข้อมูลส่วนบุคคลทราบพร้อมแนวทางการเยียวยา ในกรณีที่การละเมิดนั้นมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของเจ้าของข้อมูลส่วนบุคคล</li>
                                                        <li>(4.10) ทุกส่วนงานต้องให้ความร่วมมือกับเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล เมื่อถูกร้องขอให้ส่งเอกสารหรือข้อมูลเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล รวมถึงการชี้แจงข้อเท็จจริง เพื่อสนับสนุนการตรวจสอบและการปฏิบัติงานของเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลและสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล</li>
                                                </ul>
                                            </div>
                                         </div>
                                         <div class="row">
                                            <div class="col-xl-12 text-center">
                                                   <div class="form-check">
                                                     <input type="checkbox" class="form-check-input" id="exampleCheck1">
                                                     <label class="form-check-label mt-1 ml-2" for="exampleCheck1">ยอมรับข้อตกลง</label>
                                                </div>
                                            </div>
                                         </div>
                                </div>
                                <input type="button" name="next" class="next action-button" value="ขั้นตอนต่อไป"/>
                            </fieldset>
                            <fieldset>
                                <div class="row">
                                        <div class="col-xl-6">
                                            <div class="row">
                                                <div class="col-xl-12 text-center">
                                                    <a href="confirm_thai_id.php">
                                                        <div class="m-1 shadow-sm p-3 box mb-2  rounded box_register w-100 text-white">
                                                            <div class="row">
                                                                <div class="col-xl-12">
                                                                    <img src="assets/images/peoplelogo_0.png"  class="i-con-register" alt="">
                                                                </div>
                                                            </div>
                                                            <div class="row">
                                                                <div class="col-xl-12">
                                                                    <h4>บุคคลากร</h4>
                                                                </div>
                                                            </div>
                                                        </div>
                                                    </a>
                                                </div>
                                            </div>
                                        </div>
                                        <div class="col-xl-6">
                                            <div class="row">
                                                <div class="col-xl-12 text-center">
                                                    <a href="register.php">
                                                        <div class="m-1 shadow-sm p-3 box mb-2  rounded box_register w-100 text-white">
                                                            <div class="row">
                                                                <div class="col-xl-12">
                                                                    <img src="assets/images/homelogo_0.png"  class="i-con-register" alt="">
                                                                </div>
                                                            </div>
                                                            <div class="row">
                                                                <div class="col-xl-12">
                                                                    <h4> นิติบุคคล</h4>
                                                                </div>
                                                            </div>
                                                        </div>
                                                    </a>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                            </fieldset>
                        </form>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>




<?php include ('combottom.php') ?>


