<?php include('comtop.php') ?>
<?php include('header_2.php') ?>
<style>
    .box_comment{
        overflow-x: hidden;
        overflow-y: scroll;
    }
</style>
<div class="container main-content ">
   <div class="row">
        <div class="col-xl-12">
            <div class="shadow-sm p-3 mb-5 bg-white rounded mt-5">
                 <div class="row">
                    <div class="col-xl-12">
                        <div class="p-5">
                            <div class="row">
                                <div class="col-xl-12 text-center">
                                    <h4>ข้อตกลงในการใช้บริการอิเล็กทรอนิกส์ของกรมโยธาธิการและผังเมือง</h4>
                                </div>
                            </div>
                            <div class="row"> 
                                <div class="col-xl-12 box_comment" > 
                                    <p> กรมโยธาธิการและผังเมือง ตระหนักและให้ความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลของผู้มาติดต่อและ ใช้บริการของ กรมโยธาธิการและผังเมือง จึงเป็นการสมควรกำหนดนโยบายการคุ้มครองข้อมูลส่วนบุคคล เพื่อแจ้งให้ทราบถึงการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                                    <p>ข้อ 1 หลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคลกรมโยธาธิการและผังเมือง จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคล โดยอยู่บนพื้นฐานหลักการสำคัญในการคุ้มครองข้อมูลส่วนบุคคล ดังนี้</p>
                                        <ul class="text-multi"> 
                                            <li>(1.1) เก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลเป็นไปโดยชอบด้วยกฎหมาย เป็นธรรม และมีความโปร่งใส ต่อเจ้าของข้อมูลส่วนบุคคล</li>
                                            <li>(1.2) เก็บรวบรวมข้อมูลส่วนบุคคลด้วยวิธีการที่ชอบด้วยกฎหมาย และจัดเก็บข้อมูลเท่าที่จำเป็นตามวัตถุประสงค์ในการดำเนินงาน และตามที่กฎหมายกำหนดเท่านั้น โดยจะต้องได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล เว้นแต่เป็นกรณีที่กฎหมายกำหนดให้สามารถประมวลผลข้อมูลส่วนบุคคลได้โดยไม่ต้องได้รับความยินยอม</li>
                                            <li>(1.3) เก็บรวบรวมข้อมูลส่วนบุคคลเท่าที่จำเป็นตามวัตถุประสงค์อันชอบด้วยกฎหมาย </li>
                                            <li>(1.4) ข้อมูลส่วนบุคคลควรมีความถูกต้องและเป็นปัจจุบัน โดยจะต้องมีการดำเนินการเพื่อให้แน่ใจว่าข้อมูลส่วนบุคคลที่ไม่ถูกต้องจะได้รับการปรับปรุงแก้ไข </li>
                                            <li>(1.5) ประมวลผลข้อมูลส่วนบุคคลตามระยะเวลาเท่าที่จำเป็นต่อการประมวลผลข้อมูลส่วนบุคคล เว้นแต่กรณีมีกฎหมายกำหนดไว้ต้องจัดเก็บข้อมูลส่วนบุคคลไว้นานกว่าระยะเวลาเท่าที่จำเป็นดังกล่าว</li>
                                            <li>(1.6) การประมวลผลข้อมูลส่วนบุคคลต้องมีมาตรการในการรักษาความมั่นคงปลอดภัยที่เหมาะสม รวมถึงมีการป้องกันการประมวลผลข้อมูลส่วนบุคคลโดยไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมายและป้องกันการสูญหายโดยอุบัติเหตุ การถูกทำลาย หรือถูกทำให้เสียหาย</li>
                                        </ul>
                                </div>
                            </div>
                           
                            <div class="row">
                                <div class="col-xl-12">
                                        <small class="text-danger ">
                                            <div class="row">
                                                <div class="d-flex justify-content-center p-2">
                                                    <div class="m-1">
                                                        หมายเหตุ :
                                                    </div>
                                                    <div class="m-1">
                                                        เพิกถอนความยินยอมในข้อตกลงการใช้บริการฯ หมายถึงท่านไม่ยอมรับข้อตกลงในการใช้บริการฯ 
                                                        ไม่่อนุญาตให้ทำการเก็บรวบรวมใช้ หรือเผยแพร่ข้อมูลส่วนบุคคลของท่านอีกต่อไป
                                                        ระบบจะลบข้อมูลของท่านทั้งหมด และท่านจะได้สามารถใช้บริการระบบ SSO ได้  
                                                    </div>
                                                </div>
                                            </div>
                                        </small>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-xl-12 text-center">
                                        <button type="button" class="btn btn-danger" data-toggle="modal" data-target="#exampleModal">
                                            เพิกถอนความยินยอม
                                        </button>                    
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
   </div>
</div>
   




        



<?php include('footer.php') ?> 
<?php include ('combottom.php') ?>


